tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# SSL/TLS cryptography library
brew "openssl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# The Heroku Command Line Interface (CLI)
brew "heroku"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Object-relational database system
brew "postgresql"
# Persistent key-value database, with built-in net interface
brew "redis"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Authy
cask "authy"
# GitHub Atom
cask "atom"
# Google Chrome
cask "google-chrome"
# Figma
cask "figma"
#f.lux
cask "flux"
# Insomnia
cask "insomnia"
# iTerm2
cask "iterm2"
# Notion
cask "notion"
# Postman
cask "postman"
# Slack
cask "slack"
# Spotify
cask "spotify"
# Sublime
cask "sublime-text"

# Effortlessly override your energy saver settings
mas "Amphetamine", id: 937984704
# Enhances every sound to make your Mac’s speakers sound louder, clearer and better.
mas "Boom 2", id: 948176063
# Thousands of stunning photos from Unsplash on your Mac
mas "Irvue", id: 1039633667
# Keeps your workspace organized
mas "Magnet", id: 441258766
# Ambient sound equalizer for relax or productivity for macOS
mas "Noizio", id: 928871589
# Award-winning personal task manager
mas "Things 3", id: 904280696
